app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(params[:micropost])
    if @micropost.save
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES ('Туц пост', 1, '2011-08-13 06:33:13.218516', '2011-08-13 06:33:13.218516')