app/controllers/relationships_controller.rb

  def destroy
    @user = Relationship.find(params[:id]).followed
---
SELECT "relationships".* FROM "relationships" WHERE "relationships"."followed_id" = 2 AND ("relationships".follower_id = 1) LIMIT 1