app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "encrypted_password", "salt") VALUES ('Rails Tutorial', 'example@railstutorial.org', '2011-07-30 09:14:56.096149', '2011-07-30 09:14:56.096149', '7993be2253bd0830152f3a874b9ead50afb4412848831ad7a5fabf1461e6fc9f', 'ed3b73a36e99773e221d3a6a452de9f817342134e311ccf30e1cc1abc9b862b2')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
UPDATE "users" SET "name" = 'New Name', "email" = 'user@example.org', "encrypted_password" = '532b530a468a53b36cc73b251f6d6f0ee4c98a22eade959affd3d448998bb50f', "updated_at" = '2011-08-06 06:39:34.188059' WHERE "users"."id" = 1
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
DELETE FROM "users" WHERE "users"."id" = 6
---
  def destroy
    @user = User.find(params[:id])
    if @user.admin != true
      then
      User.find(params[:id]).destroy